notes/meeting_2021nov21.org
* meeting notes November 21, 2021                                      
** the raku study group
*** rockin' that raku sound
** the usual links:
*** meeting notes
**** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021nov14.md
*** code examples:
**** https://github.com/doomvox/raku-study/tree/main/bin/2021nov14

** agenda 
*** s//// vs .subst
**** https://www.nntp.perl.org/group/perl.perl6.users/2021/11/msg10273.html

*** doomvox: about static typing vs tests
**** https://www.reddit.com/r/programmingcirclejerk/comments/qvpasg/the_real_purpose_of_typescript_is_job_creation/hkybolj/ 

*** bruce gray challenge:
**** https://theweeklychallenge.org/blog/perl-weekly-challenge-138/

**** clifton: working on gtk bindings for raku
*****   https://gist.github.com/Xliff/b927fe54e6957b7d19b5bd7b38b45059

*** should we record meetings and post video?
**** consensus seems to be probably not
**** maybe short prepared talks presented at the meeting, and just record those

*** ephemeral miniconf
**** video not up yet (?)

*** clifton working on gnome modules for raku, glib
**** https://github.com/Xliff/p6-GLib
**** https://github.com/Xliff/p6-WebkitGTK 

*** Alan recommends the video "The Worst Programming Language"
**** https://www.youtube.com/watch?v=hCvHTrUh4os

*** William Michels, raku oneliners
**** https://unix.stackexchange.com/a/678428/227738 
**** https://unix.stackexchange.com/a/678197/227738 
**** https://unix.stackexchange.com/a/678087/227738 
**** https://unix.stackexchange.com/a/677889/227738 
**** https://unix.stackexchange.com/a/677562/227738 
**** https://unix.stackexchange.com/a/677560/227738 
**** https://unix.stackexchange.com/a/677102/227738 
**** https://unix.stackexchange.com/a/677026/227738 
**** https://unix.stackexchange.com/a/676824/227738 
**** https://unix.stackexchange.com/a/676629/227738 

*** roll your own associative
**** https://www.reddit.com/r/rakulang/comments/pocomd/a_post_which_came_out_from_a_provocation/hczsrw0/?context=3

** announcements
*** https://www.meetup.com/charlotte-pm/ 
*** https://www.meetup.com/Toronto-Perl-Mongers 

*** https://www.meetup.com/Toronto-Perl-Mongers 
*** https://www.meetup.com/ChicagoPM 
*** https://www.meetup.com/The-New-York-Perl-Meetup-Group 

** next meeting
*** next meeting: december 5

