notes/meeting_2021nov21.md
- [meeting notes November 21, 2021](#org4c8b86f)
  - [the raku study group](#orgc5cafdc)
    - [rockin' that raku sound](#orgcd12329)
  - [the usual links:](#org76b3315)
    - [meeting notes](#org0deb013)
    - [code examples:](#orgd37670c)
  - [agenda](#org335897f)
    - [s//// vs .subst](#org9a697ff)
    - [doomvox: about static typing vs tests](#org6e25ebe)
    - [bruce gray challenge:](#orge27103a)
    - [should we record meetings and post video?](#org147848c)
    - [ephemeral miniconf](#org7dd3bd3)
    - [clifton working on gnome modules for raku, glib](#org64a1b15)
    - [Alan recommends the video "The Worst Programming Language"](#orgd3da48d)
    - [William Michels, raku oneliners](#org5b27e2e)
    - [roll your own associative](#org04f5ba5)
  - [announcements](#org5725904)
    - [<https://www.meetup.com/charlotte-pm/>](#org0e0b4b2)
    - [<https://www.meetup.com/Toronto-Perl-Mongers>](#org208fcad)
    - [<https://www.meetup.com/Toronto-Perl-Mongers>](#org3bb47bf)
    - [<https://www.meetup.com/ChicagoPM>](#org65e40d1)
    - [<https://www.meetup.com/The-New-York-Perl-Meetup-Group>](#orgb046d57)
  - [next meeting](#org68c9ad2)
    - [next meeting: december 5](#org4b7d16a)


<a id="org4c8b86f"></a>

# meeting notes November 21, 2021


<a id="orgc5cafdc"></a>

## the raku study group


<a id="orgcd12329"></a>

### rockin' that raku sound


<a id="org76b3315"></a>

## the usual links:


<a id="org0deb013"></a>

### meeting notes

1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021nov14.md>


<a id="orgd37670c"></a>

### code examples:

1.  <https://github.com/doomvox/raku-study/tree/main/bin/2021nov14>


<a id="org335897f"></a>

## agenda


<a id="org9a697ff"></a>

### s//// vs .subst

1.  <https://www.nntp.perl.org/group/perl.perl6.users/2021/11/msg10273.html>


<a id="org6e25ebe"></a>

### doomvox: about static typing vs tests

1.  <https://www.reddit.com/r/programmingcirclejerk/comments/qvpasg/the_real_purpose_of_typescript_is_job_creation/hkybolj/>


<a id="orge27103a"></a>

### bruce gray challenge:

1.  <https://theweeklychallenge.org/blog/perl-weekly-challenge-138/>

2.  clifton: working on gtk bindings for raku

    1.  <https://gist.github.com/Xliff/b927fe54e6957b7d19b5bd7b38b45059>


<a id="org147848c"></a>

### should we record meetings and post video?

1.  consensus seems to be probably not

2.  maybe short prepared talks presented at the meeting, and just record those


<a id="org7dd3bd3"></a>

### ephemeral miniconf

1.  video not up yet (?)


<a id="org64a1b15"></a>

### clifton working on gnome modules for raku, glib

1.  <https://github.com/Xliff/p6-GLib>

2.  <https://github.com/Xliff/p6-WebkitGTK>


<a id="orgd3da48d"></a>

### Alan recommends the video "The Worst Programming Language"

1.  <https://www.youtube.com/watch?v=hCvHTrUh4os>


<a id="org5b27e2e"></a>

### William Michels, raku oneliners

1.  <https://unix.stackexchange.com/a/678428/227738>

2.  <https://unix.stackexchange.com/a/678197/227738>

3.  <https://unix.stackexchange.com/a/678087/227738>

4.  <https://unix.stackexchange.com/a/677889/227738>

5.  <https://unix.stackexchange.com/a/677562/227738>

6.  <https://unix.stackexchange.com/a/677560/227738>

7.  <https://unix.stackexchange.com/a/677102/227738>

8.  <https://unix.stackexchange.com/a/677026/227738>

9.  <https://unix.stackexchange.com/a/676824/227738>

10. <https://unix.stackexchange.com/a/676629/227738>


<a id="org04f5ba5"></a>

### roll your own associative

1.  <https://www.reddit.com/r/rakulang/comments/pocomd/a_post_which_came_out_from_a_provocation/hczsrw0/?context=3>


<a id="org5725904"></a>

## announcements


<a id="org0e0b4b2"></a>

### <https://www.meetup.com/charlotte-pm/>


<a id="org208fcad"></a>

### <https://www.meetup.com/Toronto-Perl-Mongers>


<a id="org3bb47bf"></a>

### <https://www.meetup.com/Toronto-Perl-Mongers>


<a id="org65e40d1"></a>

### <https://www.meetup.com/ChicagoPM>


<a id="orgb046d57"></a>

### <https://www.meetup.com/The-New-York-Perl-Meetup-Group>


<a id="org68c9ad2"></a>

## next meeting


<a id="org4b7d16a"></a>

### next meeting: december 5
